Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memr.tmx
Source language: ca
Languages: es

source: El programari que porten instal·lat les naus de la confederació galàctica inclou un programa que tradueix una de les llengües majoritàries del planeta Zkanagg, el tazkannwat, al català.
es: El software que traen instalado las naves de la confederación galáctica incluye un programa que traduce una de las lenguas mayoritarias del planeta Zkanagg, el tazkannwat, al catalán.

source: El resultat [secció 4.2]{hutchins92b} és el que es podria esperar ``d'una persona que comptara únicament amb un diccionari bilingüe molt barat i amb un coneixement molt rudimentari de la gramàtica de la llengua meta'', amb ``errors freqüents de naturalesa lèxica en la traducció i estructures sintàctiques inadequades'' que reflecteixen ``les estructures pròpies de la llengua d'origen''.
es: El resultado [sección 4.2]{hutchins92b} es el que se podría esperar ``de una persona que contaría únicamente con un diccionario bilingüe muy barato y con un conocimiento muy rudimentario de la gramática de la lengua meta'', con ``errores frecuentes de naturaleza léxica en la traducción y estructuras sintácticas inadecuadas'' que reflejan ``las estructuras propias de la lengua de origen''.

source: El resultat final es mostra en la fig. (.SN.
es: El resultado final se muestra en la fig. (.SN.

source: El resultat és que el sintagma preposicional de Zkannag queda darrere del verb.
es: El resultado es que el sintagma preposicional de Zkannag queda detrás del verbo.

source: El sistema és un sistema de transferència morfològica avançada estàndard, que llegeix els textos d'esquerra a dreta, mot a mot, busca en l'entrada els patrons de categories lèxiques que conté en el seu catàleg, selecciona el més llarg, reordena i concorda els mots del patró, els escriu, i continua després de la zona reordenada.
es: El sistema es un sistema de transferencia morfológica avance estándar, que lee los textos de izquierda a derecha, palabra a palabra, busca en la entrada los patrones de categorías léxicas que contiene en su catálogo, selecciona el más largo, reordena y concuerda las palabras del patrón, los escribe, y continúa después de la zona reordenada.

source: El transductor resultant d'aquest procés doble d'inversió--determinització és mínim (té el mínim nombre d'estats possible).
es: El transductor resultante de este proceso doble de inversión--determinización es mínimo (tiene el mínimo número de estados posible).

source: Elegeix la seqüència que està en l'ordre temporal correcte
es: Elige la secuencia que está en la orden temporal correcto

source: Elegeix una llengua origen (català, espanyol, anglés, francés o alemany) i una llengua meta (català, espanyol, anglés, francés o alemany) i dóna tres exemples de frases que es poden traduir acceptablement mot per mot però tals que si canviem un mot de les frases per un altre de la mateixa categoria, la traducció mot per mot resulta incorrecta.
es: Elige una lengua origen (catalán, español, inglés, francés o alemán) y una lengua meta (catalán, español, inglés, francés o alemán) y da tres ejemplos de frases que se pueden traducir aceptablemente palabra por palabra pero tales que si cambiamos una palabra de las frases por otro de la misma categoría, la traducción palabra por palabra resulta incorrecta.

source: Elegiu dues llengües $L_1$ i $L_2$ i poseu almenys dos exemples de traduccions mot per mot de $L_1$ a $L_2$ amb problemes de concordança.
es: Elegid dos lenguas $L_1$ y $L_2$ y poned al menos dos ejemplos de traducciones palabra por palabra de $L_1$ a $L_2$ con problemas de concordancia.

source: Ell {s'anomena} Joan.
es: Él {se denomina} Joan.

source: Ell és anomenat Joan.
es: Él es llamado Joan.

source: Els generadors morfològics es poden organitzar de forma molt similar: lligen símbol a símbol la forma lèxica i produeixen la forma superficial.
es: Los generadores morfológicos se pueden organizar de forma muy similar: ligan símbolo a símbolo la forma léxica y producen la forma superficial.

source: Els altres vèrtexs representen l'estat de l'analitzador després d'haver llegit una o més lletres.
es: Los otros vértices representan el estado del analizador después de haber leído una o más letras.

source: Els analitzadors GLR lligen les categories lèxiques d'esquerra a dreta, les desplacen a un tipus de memòria especial anomenat pila (és a dir, les hi apilen) i quan el cim de la pila conté elements que segons la gramàtica i el context immediat posterior es poden agrupar en un subarbre, els desapila, els redueix a un subarbre, i deixa el subarbre en el cim de la pila.
es: Los analizadores GLR leen las categorías léxicas de izquierda a derecha, las desplazan a un tipo de memoria especial denominada pila (es decir, se las apilan) y cuando la cumbre de la pila contiene elementos que según la gramática y el contexto inmediato posterior se puedan agrupar en un subárbol, los desapila, los reduce a un subárbol, y deja el subárbol en la cumbre de la pila.

source: Els desavantatges d'interlingua s'atenuarien si en comptes d'una representació interlingual semàntica (basada en nocions com agent, pacient, temps, etc.) fóra més aviat de naturalesa lèxica.
es: Las desventajas de interlingua se atenuarían si en vez de una representación interlingual semántica (basada en nociones como agente, paciente, tiempo, etc.) fuera más bien de naturaleza léxica.

source: Els estats finals (representats amb dos cercles concèntrics) indiquen estats en els quals l'analitzador determina que ha llegit una forma superficial completa si no queden més lletres a llegir; en alguns estats finals s'escriuen símbols addicionals per a completar l'anàlisi i, en el cas d'un homògraf (ambigüitat lèxica), totes les opcions.
es: Los estados finales (representados con dos círculos concéntricos) indican estados en los cuales el analizador determina que ha leído una forma superficial completa si no quedan más letras para leer; en algunos estados finales se escriben símbolos adicionales para completar el análisis y, en el caso de un homógrafo (ambigüedad léxica), todas las opciones.

source: Els informàtics del projecte us demanen consell sobre les regles de reordenament del sistema, ja que, per motius tècnics, només poden afegir-n'hi tres.
es: Los informáticos del proyecto os piden consejo sobre las reglas de reordenamiento del sistema, puesto que, por motivos técnicos, sólo pueden añadir tres.

source: Els informàtics que participen en el disseny d'un sistema de traducció per interlingua t'informen que cada una de les fases del sistema s'ha de executar en un ordinador diferent.
es: Los informáticos que participan en el diseño de un sistema de traducción por interlingua te informan que cada una de las fases del sistema se tiene que ejecutar en un ordenador diferente.

source: Els mots no són tots igualment freqüents en els textos.
es: Las palabras no son todas igualmente frecuentes en los textos.

source: Els plurals dels noms es fan amb -s o -es.
es: Los plurales de los nombres se hacen con -s o -se.

source: Els següents exemples estan presos per al parell espanyol--català; en cada cas, la primera frase és un exemple de traducció correcta i el segon d'incorrecta: [Homografia:] Le traje un [sombrero] $$ Li vaig portar un [barret]; Le traje un [traje] $$ Li vaig portar un [vaig portar]$^*$ (correcte: vestit).
es: Los siguientes ejemplos están tomados para el par español--catalán; en cada caso, la primera frase es un ejemplo de traducción correcta y el segundo de incorrecta: [Homografía:] Le traje uno [sombrero] $$ Le traje un [sombrero]; Le traje un [traje] $$ Le traje un [traje]$^$ (correcto: vestido).

source: Els sistemes anomenats transformers o també de transferència morfològica (vegeu ) [4.2]{arnold94b}, molts dels quals estan disponibles per internet i Reverso, en {http://www.reverso.net}.}, són exemples d'aquesta aproximació.
es: Los sistemas llamados transformers o también de transferencia morfológica (ved ) [4.2]{arnold94b}, muchos de los cuales están disponibles por internet y Reverso, en {http://www.reverso.net}.}, son ejemplos de esta aproximación.

source: Els sistemes anomenats d'interlingua apareixen en el cas extrem en què l'anàlisi de la frase d'origen és tan profunda que la traducció es pot generar directament a partir d'aquesta sense fer-hi transferència (vegeu la fig. ).
es: Los sistemas denominados de interlingua aparecen en el caso extremo en que el análisis de la frase de origen es tan profunda que la traducción se puede generar directamente a partir de esta sin hacer transferencia (véase la fig. ).

source: Els sistemes anomenats { directes} de primera generació tradueixen en tres fases [secció 4.2]{hutchins92b}: En la primera fase d'anàlisi morfològica rudimentària s'identifiquen les categories lèxiques i es redueixen les paraules a les formes no flexionades.
es: Los sistemas denominados { directos} de primera generación traducen en tres fases [sección 4.2]{hutchins92b}: En la primera fase deanálisis morfológico rudimentario se identifican las categorías léxicas y se reducen las palabras a las formas no flexionadas.

source: Els sistemes clàssics usen representacions estructurals més o menys complexes per a representar les relacions semàntiques entre els elements de la frase (de l'estil de les de la solució a l'exercici ).
es: Los sistemas clásicos usan representaciones estructurales más o menos complejas para representar las relaciones semánticas entre los elementos de la frase (del estilo de las de la solución al ejercicio ).

source: Els sistemes de transferència (sintàctica, ) prenen una drecera i van directament de l'arbre d'anàlisi sintàctica i els mots en LO a l'arbre i els mots en LM.
es: Los sistemas de transferencia (sintáctica, ) toman un atajo y van directamente del árbol de análisis sintáctico y las palabras en LO al árbol y las palabras en LM.

source: Els sistemes de traducció automàtica basats en la transferència sintàctica (és a dir, en la aproximació que diu que es poden transformar d'una banda les estructures sintàctiques ---transferència estructural--- i d'altra banda substituir el lèxic ---transferència lèxica--- fent ambdues operacions independentment) solen funcionar bé en casos senzills, però en general es fa necessària una anàlisi més profunda {hovy93j}, ja que la correspondència entre les relacions sintàctiques (subjecte, objecte, etc.) i les relacions semàntiques (agent, pacient, etc.) dels constituents d'una frase poden variar d'una llengua a una altra.
es: Los sistemas de traducción automática basados en la transferencia sintáctica (es decir, en la aproximación que dice que se pueden transformar por un lado las estructuras sintácticas---transferencia estructural--- y por otro lado sustituir el léxico---transferencia léxica--- haciendo ambas operaciones independientemente) suelen funcionar bien en casos sencillos, pero en general se hace necesaria un análisis más profundo {hovy93j}, puesto que la correspondencia entre las relaciones sintácticas (sujete, objeto, etc.) y las relaciones semánticas (agente, paciente, etc.) de los constituyentes de una frase pueden variar de una lengua a otra.

source: Els sistemes de traducció automàtica entre dues llengües amb sintaxi similar no necessiten fer massa reordenaments perquè l'ordre dels mots no varia massa d'una llengua a altra.
es: Los sistemas de traducción automática entre dos lenguas con sintaxis similar no necesitan hacer demasiados reordenamientos porque el orden de las palabras no varía demasiado de una lengua a otra.

source: Els sistemes de traducció mot per mot poden cometre, per exemple, errors en la concordança de gènere o de nombre.
es: Los sistemas de traducción palabra por palabra pueden cometer, por ejemplo, errores en la concordancia de género y número.

source: Els sistemes de transferència es classifiquen segons la naturalesa de les representacions abstractes que utilitzen: es pot parlar, en ordre de profunditat de l'anàlisi, de sistemes de transferència morfològica, de transferència sintàctica o de { transferència semàntica}.
es: Los sistemas de transferencia se clasifican según la naturaleza de las representaciones abstractas que utilizan: se puede hablar, en orden de profundidad del análisis, de sistemas de transferencia morfológica, de transferencia sintáctica o de { transferencia semántica}.

source: Els sistemes de transferència morfològica no poden tenir en compte aquesta estructura interna, i, com a resultat, necessiten moltíssimes regles per a reordenar adequadament els mots de les frases.
es: Los sistemas de transferencia morfológica no pueden tener en cuenta esta estructura interna, y, como resultado, necesitan muchísimas reglas para reordenar adecuadamente las palabras de las frases.

source: Els sistemes de transferència morfològica no són molt diferents dels ``directes'' descrits més amunt: la fase d'anàlisi analitza morfològicament els mots de la frase però no identifica les relacions (sintàctiques) entre ells.
es: Los sistemas de transferencia morfológica no son muy diferentes de los ``directos'' descritos más arriba: la fase deanálisis analiza morfológicamente las palabras de la frase pero no identifica las relaciones (sintácticas) entre ellas.

source: Els sistemes de transferència morfològica per reordenament de patrons assumeixen que una oració és una seqüència lineal de sintagmes d'estructura lineal; aquest model de la sintaxi d'una oració pot ser molt limitat en moltes aplicacions de traducció automàtica.
es: Los sistemas de transferencia morfológica por reordenamiento de patrones asumen que una oración es una secuencia lineal de sintagmas de estructura lineal; este modelo de la sintaxis de una oración puede ser muy limitado en muchas aplicaciones de traducción automática.

source: Els sistemes de transferència semàntica construeixen representacions intermèdies més profundes; l'anàlisi i la generació són més complexes, però la transferència se simplifica.
es: Los sistemas de transferencia semántica construyen representaciones intermedias más profundas; el análisis y la generación son más complejos, pero la transferencia se simplifica.

source: Els sistemes de transferència semàntica fan anàlisi semàntica sense fer anàlisi sintàctica.
es: Los sistemas de transferencia semántica hacen análisis semántico sin hacer análisis sintáctico.

source: Els sistemes de transferència sintàctica fan anàlisi sintàctica sense fer anàlisi morfològica.
es: Los sistemas de transferencia sintáctica hacen análisis sintáctico sin hacer análisis morfológico.

source: Els transductors en qüestió són capaços d'entregar totes les anàlisis morfològiques possibles d'un homògraf (vegeu la secció ).
es: Los transductores en cuestión son capaces de entregar todos los análisis morfológicos posibles de un homógrafo (mirad la sección ).

source: En aquest sentit, els sistemes de transferència semàntica i d'interlingua proven de construir una representació semàntica a partir de l'arbre i de la semàntica dels mots, de manera que fan una interpretació més general del principi.
es: En este sentido, los sistemas de transferencia semántica y de interlingua prueban de construir una representación semántica a partir del árbol y de la semántica de las palabras, de forma que hacen una interpretación más general del principio.

source: En aquests sistemes, la representació abstracta (RALO) que s'obté en l'anàlisi inclou un arbre d'anàlisi sintàctica de la frase en la LO (o una entitat equivalent), que descriu les relacions sintàctiques existents entre les parts de la frase, a més de la informació morfològica necessària per a fer-ne la traducció.
es: En estos sistemas, la representación abstracta (RALO) que se obtiene en el análisis incluye un árbol de análisis sintáctico de la frase en la LO (o una entidad equivalente), que describe las relaciones sintácticas existentes entre las partes de la frase, además de la información morfológica necesaria para hacer la traducción.

source: En cada una de les frases, la raó lingüística per la qual la segona traducció és incorrecta ha de ser diferent.
es: En cada una de las frases, la razón lingüística por la cual la segunda traducción es incorrecta tiene que ser diferente.

source: En català podem dir vam enfonsar el vaixell però no *el vaixell enfonsa, perquè en català el verb no és ergatiu: la transferència sintàctica fallaria.
es: En catalán podemos decir vam enfonsar el vaixell pero no el vaixell enfonsa, porque en catalán el verbo no es ergativo: la transferencia sintáctica fallaría.

source: En concret, els analitzadors morfològics es poden basar en transductors de lletres , una subclasse dels transductors d'estats finits; de fet, qualsevol transductor d'estats finits es pot convertir sempre en un transductor de lletres.
es: En concreto, los analizadores morfológicos se pueden basar en transductores de letras , una subclase de los transductores de estados finitos; de hecho, cualquier transductor de estados finitos se puede convertir siempre en un transductor de letras.

source: En concret, i per posar un exemple, estudiem parells de mots gramaticalment vàlids on el primer mot apareix unes 400 vegades en total en el corpus i el segon mot hi apareix unes 200.
es: En concreto, y para poner un ejemplo, estudiamos pares de palabras gramaticalmente válidas donde la primera palabra aparece unas 400 veces en total en el corpus y la segunda palabra aparece unas 200.

source: En el cas d'{ angoixem}, el procés hauria estat idèntic fins a { angoixe-}: a n g o i x e m a n g o ixa - - r<verb><presind><1><pl> r<verb><pressub><1><pl> r<verb><imper><1><pl> En aquest cas, el mot té tres anàlisis morfològiques diferents.
es: En el caso de { angoixem}, el proceso habría sido idéntico hasta { angoixe-}: a n g o i x e m a n g o ixa - - r<verb><presind><1><pl> r<verb><pressu><1><pl> r<verb><imper><1><pl> En este caso, la palabra tiene tres análisis morfológicos diferentes.

source: En el cas general d'afegir una llengua a un conjunt de $N$ llengües, calen $2N$ nous mòduls de transferència.
es: En el caso general de añadir una lengua a un conjunto de $N$ lenguas, hacen falta $2N$ nuevos módulos de transferencia.

source: En el paradigma generatiu, si la mateixa regla de generació es pot aplicar repetidament a un sintagma, aquest sintagma es pot allargar indefinidament.
es: En el paradigma generativo, si la misma regla de generación se puede aplicar repetidamente a un sintagma, este sintagma se puede alargar indefinidamente.

source: En general, per a $N$ llengües $L_1, L_2, , L_N$ hi hauria $N$ mòduls d'anàlisi, $N$ mòduls de generació i $N(N-1)$ mòduls de transferència.
es: En general, para$N$ lenguas $L_1, L_2, , L_N$ habría $N$ módulos de análisis, $N$ módulos de generación y $N(N-1)$ módulos de transferencia.

source: En general, pot haver-hi més d'un camí; açò s'ha d'evitar i, de fet, s'elimina parcialment amb la determinització (vegeu més avall).
es: En general, puede haber más de un camino; esto se tiene que evitar y, de hecho, se elimina parcialmente con la determinización (mirad más abajo).

source: En informàtica teòrica, les màquines idealitzades que representen aquesta classe de GDA s'anomenen transductors d'estats finits $p$-subseqüencials sense cicles, on $p$ indica el nombre de possibles opcions en els estats finals.
es: En informática teórica, las máquinas idealizadas que representan esta clase de GDA se llaman transductores de estados finitos $p$-subsecuenciales sin ciclos, donde $p$ indica el número de posibles opciones en los estados finales.

source: En l'anàlisi morfològica, aquesta situació correspondria a l'ambigüitat lèxica).
es: En el análisis morfológico, esta situación correspondería a laambigüedad léxica).

source: En l'anàlisi morfològica, els símbols de $$ són els que es troben en els textos i els de $$ són els necessaris per a formar els lemes i els símbols especials que representen la informació morfològica com ara { <nom>}, { <fem>}, { <2p>}, etc.
es: En el análisis morfológico, los símbolos de $$ son los que se encuentran en los textos y los de $$ son los necesarios para formar los lemas y los símbolos especiales que representan la información morfológica como ahora { <nombre>}, { <fem>}, { <2p>}, etc.

source: En l'intent de representar els significats de totes les frases de totes les llengües, les interlingües clàssiques acabarien per ser ``models del món''.
es: En el intento de representar los significados de todas las frases de todas las lenguas, las interlinguas clásicas acabarían porser "modelos del mundo''.

source: En la RALO s'eliminen tots els detalls de la frase en LO que no són rellevants per a la traducció i se'n destaquen aquelles característiques i relacions que sí que ho són.
es: En la RALO se eliminan todos los detalles de la frase en LO que no son relevantes para la traducción y se destacan aquellas características y relaciones que sí que lo son.

source: En la fase de transferència, s'apliquen regles de transferència estructural que transformen la representació sintàctica de la frase d'entrada (la RALO) en una representació sintàctica de la traducció (la RALM) usant regles de transformació d'estructures i de transferència lèxica que tradueixen els mots en LO a mots en LM usant un diccionari bilingüe.
es: En la fase de transferencia, se aplican reglas de transferencia estructural que transforman la representación sintáctica de la frase de entrada (la RALO) en una representación sintáctica de la traducción (la RALM) usando reglas de transformación de estructuras y de transferencia léxica que traducen las palabras en LO a palabras en LM usando un diccionario bilingüe.

source: En la figura es pot veure una part de l'analitzador morfològic, corresponent als mots que comencen per ang-.
es: En la figura se puede ver una parte del analizador morfológico, correspondiente a las palabras que comienzan por ang-.

source: En la taula, el símbol $$ indica tant el principi com el final de la oració (l'anàlisi d'una oració comença apilant $$ en la pila).
es: En la tabla, el símbolo $$ indica tanto el principio como el final de la oración (el análisis de una oración empieza apilando $$ en la pila).

source: En mencionarem molt breument dues: La traducció automàtica estadística, inventada cap a finals dels vuitanta per un grup d'investigadors d'IBM {brown90j} construeix models probabilístics que indiquen, per exemple, la probabilitat que els mots d'una oració en llengua meta s'ordenen d'una determinada manera, la probabilitat que la traducció d'un determinat mot en una llengua siga traducció d'un determinat mot en l'altra, la probabilitat que la traducció d'un mot siga una expressió de més d'un mot o la probabilitat de determinats reordenaments, i, usa aquests models per a obtenir la traducció més probable de noves oracions que no ha vist anteriorment.
es: Mencionaremos muy brevemente dos: La traducción automática estadística, inventada hacia finales de los ochenta por un grupo de investigadores de IBM {brown90j} construye modelos probabilísticos que indican, por ejemplo, la probabilidad que las palabras de una oración en lengua meta se ordenan de una determinada manera, la probabilidad que la traducción de una determinada palabra en una lengua sea traducción de una determinada palabra en la otra, la probabilidad que la traducción de una palabra sea una expresión de más de una palabra o la probabilidad de determinados reordenamientos, y, usa estos modelos para obtener la traducción más probable de nuevas oraciones que no ha visto anteriormente.
